In [2]:
import sqlite3
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('/Users/ilamosin/ab_test_pet/app_logs.csv', parse_dates=['date'])
df.head(5)

,date,user_id,exp_group,session_id,session_length,device,order_cnt,price,quantity_cnt
0,2022-06-21,1727468184902936832,0,16557919071727468184902936832,1752,mobile,0,0.0,0
1,2022-06-21,3556219827372626733,0,16558186423556219827372626733,86,mobile,0,0.0,0
2,2022-06-21,2136855388003761026,0,16558402842136855388003761026,222,mobile,0,0.0,0
3,2022-06-21,4593970126020001597,0,16558003654593970126020001597,400,mobile,0,0.0,0
4,2022-06-21,3962568860806737949,1,16558324233962568860806737949,1300,mobile,0,0.0,0

## EDA (exploratory data analysis)

We released new interface feature on all platforms and want to know is it helpful for our users and is there profit for our product and business.

date - дата 
user_id - айди пользователя
exp_group - группа (тестовая/контрольная)
session_id - айди сессии 
session_length - длинна сессии 
device - устройство
order_cnt - количество заказов 
price - суммарная стоимость
quantity_cnt - количество заказанных позиций?

In [37]:
#get info about all dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 269142 entries, 0 to 269141
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   date            269142 non-null  datetime64[ns]
 1   user_id         269142 non-null  int64
 2   exp_group       269142 non-null  int64
 3   session_id      269142 non-null  object
 4   session_length  269142 non-null  int64
 5   device          269142 non-null  object
 6   order_cnt       269142 non-null  int64
 7   price           269142 non-null  float64
 8   quantity_cnt    269142 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(5), object(2)
memory usage: 18.5+ MB

In [38]:
print(f'Devices which users use: {df.device.unique()}')
print(f'Unique users count: {df.user_id.nunique()}')
print(f'Unique session count: {df.session_id.nunique()}')
print(f'Max date: {df.date.max()}')
print(f'Min date: {df.date.min()}')
print(f'Diff between count session_id and unique session_id : {df.session_id.count()-df.session_id.nunique()}')

Devices which users use: ['mobile' 'desktop' 'tablet']
Unique users count: 68287
Unique session count: 267929
Max date: 2022-07-13 00:00:00
Min date: 2022-06-21 00:00:00
Diff between count session_id and unique session_id : 1213

We have diff between count session_id and unique session_id, its mau meen that one user have more then one action at one session. Lets check it.

In [111]:
two_more_sess = df\
    .groupby(['user_id', 'session_id', 'device'])\
    .agg({'session_id':'count'})\
    .rename(columns={'session_id':'count_s'})\
    .query('count_s>1')\
    .sort_values('count_s',  ascending=False)\
    .reset_index()\
    .head(20)

In [112]:
two_more_sess

                user_id                     session_id   device  count_s
0     16965268489840455    165584166516965268489840455  desktop        2
1   6188767753121332219  16571344236188767753121332219  desktop        2
2   6179372293126118898  16574857006179372293126118898   mobile        2
3   6178250370357987265  16558445156178250370357987265   mobile        2
4   6162080960945238324  16573105496162080960945238324  desktop        2
5   6162080960945238324  16572272406162080960945238324  desktop        2
6   6162080960945238324  16562757896162080960945238324  desktop        2
7   6157659880517790061  16567937066157659880517790061  desktop        2
8   6157032325675880426  16570546826157032325675880426   mobile        2
9   6149419174013868201  16575728676149419174013868201  desktop        2
10  6147487151702887366  16558399786147487151702887366  desktop        2
11  6138613225268086257  16570512376138613225268086257  desktop        2
12  6137510642755099987  16567945666137510642755099987  desktop        2
13  6126852092874456378  16574866836126852092874456378  desktop        2
14  6115587785340822870  16570544446115587785340822870   mobile        2
15  6108630853158930717  16558438876108630853158930717  desktop        2
16  6095234008307838377  16562764596095234008307838377  desktop        2
17  6180726904333254161  16569673066180726904333254161  desktop        2
18  6201061431287574149  16568809916201061431287574149  desktop        2
19  6087415308146188769  16567944336087415308146188769   mobile        2

In [100]:
df[df['session_id']=='16569673066180726904333254161']

,date,user_id,exp_group,session_id,session_length,device,order_cnt,price,quantity_cnt
157890,2022-07-04,6180726904333254161,1,16569673066180726904333254161,1065,desktop,0,0.0,0
175317,2022-07-05,6180726904333254161,1,16569673066180726904333254161,1958,desktop,0,0.0,0

In [90]:
df[df['session_id']=='16567944336087415308146188769']

,date,user_id,exp_group,session_id,session_length,device,order_cnt,price,quantity_cnt
143798,2022-07-02,6087415308146188769,1,16567944336087415308146188769,1149,mobile,0,0.0,0
149475,2022-07-03,6087415308146188769,1,16567944336087415308146188769,895,mobile,0,0.0,0

The reason why we have duplicated session_id at the moment it is difficult to explain. Maybe we have some bug.

In [68]:
df.shape

(269142, 9)

In [10]:
df.isna().sum()

date              0
user_id           0
exp_group         0
session_id        0
session_length    0
device            0
order_cnt         0
price             0
quantity_cnt      0
dtype: int64

We have product where users make orders. Maybe something like marketplace. 
Users can make their orders from devices like mobile, desktop, tablet.
Signals which we have: session_length, order_cnt, price, quantity_cnt

Now lets aggregate signals to the metriсs, some of it - average check, asl(Average session length), arpu, arppu, count of session, Total number of orders

Using sql for this

conversion: 
conversion to payment 

users:
arppu = sum(price)/sum(user_id which make order)
arpu = sum(price)/sum(user_id) 
asl = ((sum sessions length)/(sum count ssessions))
count of session = count of seesion on one user

ratio metrics:
average check = sum(price)/count(price)
average number of orders in the check
percentage of sessions that ended in payment

## Aggregating signals to the metrics

In [115]:
con = sqlite3.connect('db')

In [116]:
df.to_sql('metrics', con, index=False, if_exists='replace')

269142

In [400]:
sql = '''
WITH mertics AS (
    SELECT
        date,
        user_id,
        exp_group,
        session_id,
        session_length,
        device,
        price,
        order_cnt,
        quantity_cnt,
        IIF(sum(price)>0, 1, 0) AS conversion,
        sum(session_length)/(count(session_length)) AS asl,
        count(session_id) AS count_of_session,
        IIF(price >0 , sum(price)/count(price), 0) as avg_rev,
        sum(quantity_cnt)/count(quantity_cnt) as avg_qnt
    FROM 
        metrics
    GROUP BY
        user_id
),
arpu as (
    SELECT 
        order_cnt,
        price,
        exp_group,
        sum(price)/count(distinct user_id) as arpu
    FROM 
        metrics
    GROUP BY 
        exp_group
),
arppu as (
    SELECT 
        order_cnt,
        price,
        exp_group,
        sum(price)/count(distinct user_id) as arppu
    FROM 
        metrics
    WHERE price>0 and order_cnt>0
    GROUP BY exp_group
),
count_pay_ses as (
    SELECT
    exp_group,
    count(session_id) pay_ses
FROM
    mertics
WHERE 
    conversion==1
GROUP BY 
    exp_group
),
count_all_ses as (
    SELECT
    exp_group,
    count(session_id) all_ses
FROM
    mertics
GROUP BY 
    exp_group
)
SELECT
    m.user_id as user_id,
    m.exp_group,
    m.session_id,
    avg_qnt,
    conversion,
    asl,
    count_of_session,
    avg_rev,
    arpu,
    arppu,
    ((pay_ses*1.0)/all_ses)*100 perc_pay_ses
FROM
   mertics m
   LEFT JOIN arpu a1 USING(exp_group)
   LEFT JOIN arppu a2 USING(exp_group)
   LEFT JOIN count_all_ses USING (exp_group)
   LEFT JOIN count_pay_ses USING (exp_group)
GROUP BY 
    user_id
'''

In [401]:
df_f = pd.read_sql(sql, con)

In [407]:
df[df['user_id']==9223272807582961860]

,date,user_id,exp_group,session_id,session_length,device,order_cnt,price,quantity_cnt
193223,2022-07-07,9223272807582961860,1,16571824119223272807582961860,402,desktop,1,4971.8319,2
194222,2022-07-07,9223272807582961860,1,16571969709223272807582961860,36,desktop,1,4971.8319,2
195712,2022-07-07,9223272807582961860,1,16571695339223272807582961860,1022,desktop,1,4971.8319,2
200214,2022-07-07,9223272807582961860,1,16571915829223272807582961860,28,desktop,1,4971.8319,2
206673,2022-07-08,9223272807582961860,1,16572643169223272807582961860,29,desktop,1,4971.8319,2
210098,2022-07-08,9223272807582961860,1,16572711199223272807582961860,401,desktop,1,4971.8319,2
212259,2022-07-08,9223272807582961860,1,16572540399223272807582961860,32,desktop,1,4971.8319,2
213218,2022-07-08,9223272807582961860,1,16572623659223272807582961860,9,desktop,1,4971.8319,2
218372,2022-07-09,9223272807582961860,1,16573552769223272807582961860,32,desktop,1,4971.8319,2
220174,2022-07-09,9223272807582961860,1,16573422619223272807582961860,280,desktop,1,4971.8319,2
225063,2022-07-10,9223272807582961860,1,16574515039223272807582961860,37,desktop,1,4971.8319,2
231882,2022-07-10,9223272807582961860,1,16574340469223272807582961860,75,desktop,1,4971.8319,2
232409,2022-07-10,9223272807582961860,1,16574494749223272807582961860,34,desktop,1,4971.8319,2
243740,2022-07-11,9223272807582961860,1,16575141359223272807582961860,1946,desktop,1,4971.8319,2

In [406]:
df_f[df_f['user_id']==9223272807582961860]

,user_id,exp_group,session_id,avg_qnt,conversion,asl,count_of_session,avg_rev,arpu,arppu,perc_pay_ses
68286,9223272807582961860,1,16571824119223272807582961860,2,1,311,14,4971.8319,4245.785005,26189.400486,16.223295